{
  "title": "NIH Data Management and Sharing Plan: Survey + Interview Study on Research Data Management Practices",
  "funding_agency": "NIH",
  "use_rag": false,
  "inputs": {
    "research_context": "This project studies research data management and sharing practices among biomedical researchers and research support professionals. The study uses an online survey and optional semi-structured interviews to understand current workflows, perceived barriers to data sharing, use of repositories and metadata standards, and preferences for tools that assist with creating data management plans. Analyses include descriptive statistics, subgroup comparisons where appropriate, qualitative coding of open-ended responses, and synthesis of findings to inform recommendations and tool design. The project will produce reusable de-identified datasets, codebooks, analysis scripts, and documented qualitative coding outputs to support transparency and replication.",
    "data_types": "Scientific data generated include (1) survey response data (Likert-scale items, multiple-choice responses, and free-text responses) exported in CSV; (2) interview data including audio recordings when collected and permitted, verbatim transcripts, and de-identified transcript versions for sharing; (3) derived datasets such as cleaned survey tables, recoded variables, summary statistics tables, and qualitative coding matrices; (4) analysis outputs including figures/tables, codebooks, and aggregated summaries; (5) software/code such as survey instrument versions, interview guides, coding manuals, and analysis scripts (e.g., Python/R notebooks, qualitative coding exports), plus environment specifications; and (6) documentation such as README files, data dictionaries, instrument metadata, recruitment materials, and provenance notes describing processing steps.",
    "data_source": "Data will be collected from adult participants recruited through professional networks, email invitations, and/or public postings approved by the study team. The survey will be administered using an online survey platform, and interviews will be conducted via video conference or phone when participants opt in. Collection procedures include standardized survey instruments, consistent interview guides, and secure storage of raw exports. Quality checks will include validation of required fields, removal of duplicate submissions when identifiable, and documentation of exclusion criteria for incomplete or invalid responses.",
    "human_subjects": "Yes. This project involves human participants. Responses will be collected and stored securely, and any shared datasets will be de-identified. Direct identifiers (e.g., names, email addresses, institutional IDs, phone numbers) will not be collected when feasible; if collected for scheduling or incentives, they will be stored separately from study data. Free-text responses and interview transcripts will be reviewed to remove or redact indirect identifiers. Audio files will not be shared publicly unless explicitly permitted by consent and risk assessment; when not shareable, de-identified transcripts and/or coded excerpts will be shared instead.",
    "consent_status": "Participation is voluntary, and informed consent will be obtained consistent with institutional requirements. Consent materials will describe what data are collected, how confidentiality is protected, and what de-identified data may be shared. Participants will be able to opt in or out of interview recording. If consent limits sharing of certain elements (e.g., audio recordings or identifiable quotes), those elements will be excluded from public release and shared only in restricted form if needed (e.g., controlled access to vetted researchers). The plan will document the final scope of shareable data and any restrictions.",
    "data_volume": "Estimated total volume is approximately 1–10 GB depending on the number of interviews and whether audio recordings are retained. Survey data and derived tables are expected to be relatively small (<500 MB). Interview audio (if collected) may represent the largest portion of storage; transcripts and coded datasets will be shared as text/CSV. Public releases will include de-identified survey tables, a codebook/data dictionary, de-identified transcripts when permitted, qualitative coding outputs, and analysis scripts with documentation to enable reproduction of key results."
  }
}
